# Создать класс комплексного числа и реализовать для него арифметические операции.

from math import *
#class complex:

x = complex(1,2)
y = complex(3, 4)
print(x)
print(x.real)
print(x.imag)

print(y)
print(y.real)
print(y.imag)

z = x + y
print(z)
